gitmac56/Git_IR_REMO/PSoC/C4245AZI-483.cydsn/codegentemp/UART1.c
/***************************************************************************//**
* \file UART1.c
* \version 4.0
*
* \brief
*  This file provides the source code to the API for the SCB Component.
*
* Note:
*
*******************************************************************************
* \copyright
* Copyright 2013-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "UART1_PVT.h"

#if (UART1_SCB_MODE_I2C_INC)
    #include "UART1_I2C_PVT.h"
#endif /* (UART1_SCB_MODE_I2C_INC) */

#if (UART1_SCB_MODE_EZI2C_INC)
    #include "UART1_EZI2C_PVT.h"
#endif /* (UART1_SCB_MODE_EZI2C_INC) */

#if (UART1_SCB_MODE_SPI_INC || UART1_SCB_MODE_UART_INC)
    #include "UART1_SPI_UART_PVT.h"
#endif /* (UART1_SCB_MODE_SPI_INC || UART1_SCB_MODE_UART_INC) */


/***************************************
*    Run Time Configuration Vars
***************************************/

/* Stores internal component configuration for Unconfigured mode */
#if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    /* Common configuration variables */
    uint8 UART1_scbMode = UART1_SCB_MODE_UNCONFIG;
    uint8 UART1_scbEnableWake;
    uint8 UART1_scbEnableIntr;

    /* I2C configuration variables */
    uint8 UART1_mode;
    uint8 UART1_acceptAddr;

    /* SPI/UART configuration variables */
    volatile uint8 * UART1_rxBuffer;
    uint8  UART1_rxDataBits;
    uint32 UART1_rxBufferSize;

    volatile uint8 * UART1_txBuffer;
    uint8  UART1_txDataBits;
    uint32 UART1_txBufferSize;

    /* EZI2C configuration variables */
    uint8 UART1_numberOfAddr;
    uint8 UART1_subAddrSize;
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */


/***************************************
*     Common SCB Vars
***************************************/
/**
* \addtogroup group_general
* \{
*/

/** UART1_initVar indicates whether the UART1 
*  component has been initialized. The variable is initialized to 0 
*  and set to 1 the first time SCB_Start() is called. This allows 
*  the component to restart without reinitialization after the first 
*  call to the UART1_Start() routine.
*
*  If re-initialization of the component is required, then the 
*  UART1_Init() function can be called before the 
*  UART1_Start() or UART1_Enable() function.
*/
uint8 UART1_initVar = 0u;


#if (! (UART1_SCB_MODE_I2C_CONST_CFG || \
        UART1_SCB_MODE_EZI2C_CONST_CFG))
    /** This global variable stores TX interrupt sources after 
    * UART1_Stop() is called. Only these TX interrupt sources 
    * will be restored on a subsequent UART1_Enable() call.
    */
    uint16 UART1_IntrTxMask = 0u;
#endif /* (! (UART1_SCB_MODE_I2C_CONST_CFG || \
              UART1_SCB_MODE_EZI2C_CONST_CFG)) */
/** \} globals */

#if (UART1_SCB_IRQ_INTERNAL)
#if !defined (CY_REMOVE_UART1_CUSTOM_INTR_HANDLER)
    void (*UART1_customIntrHandler)(void) = NULL;
#endif /* !defined (CY_REMOVE_UART1_CUSTOM_INTR_HANDLER) */
#endif /* (UART1_SCB_IRQ_INTERNAL) */


/***************************************
*    Private Function Prototypes
***************************************/

static void UART1_ScbEnableIntr(void);
static void UART1_ScbModeStop(void);
static void UART1_ScbModePostEnable(void);


/*******************************************************************************
* Function Name: UART1_Init
****************************************************************************//**
*
*  Initializes the UART1 component to operate in one of the selected
*  configurations: I2C, SPI, UART or EZI2C.
*  When the configuration is set to "Unconfigured SCB", this function does
*  not do any initialization. Use mode-specific initialization APIs instead:
*  UART1_I2CInit, UART1_SpiInit, 
*  UART1_UartInit or UART1_EzI2CInit.
*
*******************************************************************************/
void UART1_Init(void)
{
#if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    if (UART1_SCB_MODE_UNCONFIG_RUNTM_CFG)
    {
        UART1_initVar = 0u;
    }
    else
    {
        /* Initialization was done before this function call */
    }

#elif (UART1_SCB_MODE_I2C_CONST_CFG)
    UART1_I2CInit();

#elif (UART1_SCB_MODE_SPI_CONST_CFG)
    UART1_SpiInit();

#elif (UART1_SCB_MODE_UART_CONST_CFG)
    UART1_UartInit();

#elif (UART1_SCB_MODE_EZI2C_CONST_CFG)
    UART1_EzI2CInit();

#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */
}


/*******************************************************************************
* Function Name: UART1_Enable
****************************************************************************//**
*
*  Enables UART1 component operation: activates the hardware and 
*  internal interrupt. It also restores TX interrupt sources disabled after the 
*  UART1_Stop() function was called (note that level-triggered TX 
*  interrupt sources remain disabled to not cause code lock-up).
*  For I2C and EZI2C modes the interrupt is internal and mandatory for 
*  operation. For SPI and UART modes the interrupt can be configured as none, 
*  internal or external.
*  The UART1 configuration should be not changed when the component
*  is enabled. Any configuration changes should be made after disabling the 
*  component.
*  When configuration is set to “Unconfigured UART1”, the component 
*  must first be initialized to operate in one of the following configurations: 
*  I2C, SPI, UART or EZ I2C, using the mode-specific initialization API. 
*  Otherwise this function does not enable the component.
*
*******************************************************************************/
void UART1_Enable(void)
{
#if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    /* Enable SCB block, only if it is already configured */
    if (!UART1_SCB_MODE_UNCONFIG_RUNTM_CFG)
    {
        UART1_CTRL_REG |= UART1_CTRL_ENABLED;

        UART1_ScbEnableIntr();

        /* Call PostEnable function specific to current operation mode */
        UART1_ScbModePostEnable();
    }
#else
    UART1_CTRL_REG |= UART1_CTRL_ENABLED;

