gitmac56/Git_IR_REMO/PSoC/C4245AZI-483.cydsn/codegentemp/UART1.c
    UART1_ScbEnableIntr();

    /* Call PostEnable function specific to current operation mode */
    UART1_ScbModePostEnable();
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */
}


/*******************************************************************************
* Function Name: UART1_Start
****************************************************************************//**
*
*  Invokes UART1_Init() and UART1_Enable().
*  After this function call, the component is enabled and ready for operation.
*  When configuration is set to "Unconfigured SCB", the component must first be
*  initialized to operate in one of the following configurations: I2C, SPI, UART
*  or EZI2C. Otherwise this function does not enable the component.
*
* \globalvars
*  UART1_initVar - used to check initial configuration, modified
*  on first function call.
*
*******************************************************************************/
void UART1_Start(void)
{
    if (0u == UART1_initVar)
    {
        UART1_Init();
        UART1_initVar = 1u; /* Component was initialized */
    }

    UART1_Enable();
}


/*******************************************************************************
* Function Name: UART1_Stop
****************************************************************************//**
*
*  Disables the UART1 component: disable the hardware and internal 
*  interrupt. It also disables all TX interrupt sources so as not to cause an 
*  unexpected interrupt trigger because after the component is enabled, the 
*  TX FIFO is empty.
*  Refer to the function UART1_Enable() for the interrupt 
*  configuration details.
*  This function disables the SCB component without checking to see if 
*  communication is in progress. Before calling this function it may be 
*  necessary to check the status of communication to make sure communication 
*  is complete. If this is not done then communication could be stopped mid 
*  byte and corrupted data could result.
*
*******************************************************************************/
void UART1_Stop(void)
{
#if (UART1_SCB_IRQ_INTERNAL)
    UART1_DisableInt();
#endif /* (UART1_SCB_IRQ_INTERNAL) */

    /* Call Stop function specific to current operation mode */
    UART1_ScbModeStop();

    /* Disable SCB IP */
    UART1_CTRL_REG &= (uint32) ~UART1_CTRL_ENABLED;

    /* Disable all TX interrupt sources so as not to cause an unexpected
    * interrupt trigger after the component will be enabled because the 
    * TX FIFO is empty.
    * For SCB IP v0, it is critical as it does not mask-out interrupt
    * sources when it is disabled. This can cause a code lock-up in the
    * interrupt handler because TX FIFO cannot be loaded after the block
    * is disabled.
    */
    UART1_SetTxInterruptMode(UART1_NO_INTR_SOURCES);

#if (UART1_SCB_IRQ_INTERNAL)
    UART1_ClearPendingInt();
#endif /* (UART1_SCB_IRQ_INTERNAL) */
}


/*******************************************************************************
* Function Name: UART1_SetRxFifoLevel
****************************************************************************//**
*
*  Sets level in the RX FIFO to generate a RX level interrupt.
*  When the RX FIFO has more entries than the RX FIFO level an RX level
*  interrupt request is generated.
*
*  \param level: Level in the RX FIFO to generate RX level interrupt.
*   The range of valid level values is between 0 and RX FIFO depth - 1.
*
*******************************************************************************/
void UART1_SetRxFifoLevel(uint32 level)
{
    uint32 rxFifoCtrl;

    rxFifoCtrl = UART1_RX_FIFO_CTRL_REG;

    rxFifoCtrl &= ((uint32) ~UART1_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK); /* Clear level mask bits */
    rxFifoCtrl |= ((uint32) (UART1_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK & level));

    UART1_RX_FIFO_CTRL_REG = rxFifoCtrl;
}


/*******************************************************************************
* Function Name: UART1_SetTxFifoLevel
****************************************************************************//**
*
*  Sets level in the TX FIFO to generate a TX level interrupt.
*  When the TX FIFO has less entries than the TX FIFO level an TX level
*  interrupt request is generated.
*
*  \param level: Level in the TX FIFO to generate TX level interrupt.
*   The range of valid level values is between 0 and TX FIFO depth - 1.
*
*******************************************************************************/
void UART1_SetTxFifoLevel(uint32 level)
{
    uint32 txFifoCtrl;

    txFifoCtrl = UART1_TX_FIFO_CTRL_REG;

    txFifoCtrl &= ((uint32) ~UART1_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK); /* Clear level mask bits */
    txFifoCtrl |= ((uint32) (UART1_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK & level));

    UART1_TX_FIFO_CTRL_REG = txFifoCtrl;
}


#if (UART1_SCB_IRQ_INTERNAL)
    /*******************************************************************************
    * Function Name: UART1_SetCustomInterruptHandler
    ****************************************************************************//**
    *
    *  Registers a function to be called by the internal interrupt handler.
    *  First the function that is registered is called, then the internal interrupt
    *  handler performs any operation such as software buffer management functions
    *  before the interrupt returns.  It is the user's responsibility not to break
    *  the software buffer operations. Only one custom handler is supported, which
    *  is the function provided by the most recent call.
    *  At the initialization time no custom handler is registered.
    *
    *  \param func: Pointer to the function to register.
    *        The value NULL indicates to remove the current custom interrupt
    *        handler.
    *
    *******************************************************************************/
    void UART1_SetCustomInterruptHandler(void (*func)(void))
    {
    #if !defined (CY_REMOVE_UART1_CUSTOM_INTR_HANDLER)
        UART1_customIntrHandler = func; /* Register interrupt handler */
    #else
        if (NULL != func)
        {
            /* Suppress compiler warning */
        }
    #endif /* !defined (CY_REMOVE_UART1_CUSTOM_INTR_HANDLER) */
    }
#endif /* (UART1_SCB_IRQ_INTERNAL) */


