gitmac56/Git_IR_REMO/PSoC/C4245AZI-483.cydsn/codegentemp/UART1.c
/*******************************************************************************
* Function Name: UART1_ScbModeEnableIntr
****************************************************************************//**
*
*  Enables an interrupt for a specific mode.
*
*******************************************************************************/
static void UART1_ScbEnableIntr(void)
{
#if (UART1_SCB_IRQ_INTERNAL)
    /* Enable interrupt in NVIC */
    #if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
        if (0u != UART1_scbEnableIntr)
        {
            UART1_EnableInt();
        }

    #else
        UART1_EnableInt();

    #endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */
#endif /* (UART1_SCB_IRQ_INTERNAL) */
}


/*******************************************************************************
* Function Name: UART1_ScbModePostEnable
****************************************************************************//**
*
*  Calls the PostEnable function for a specific operation mode.
*
*******************************************************************************/
static void UART1_ScbModePostEnable(void)
{
#if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
#if (!UART1_CY_SCBIP_V1)
    if (UART1_SCB_MODE_SPI_RUNTM_CFG)
    {
        UART1_SpiPostEnable();
    }
    else if (UART1_SCB_MODE_UART_RUNTM_CFG)
    {
        UART1_UartPostEnable();
    }
    else
    {
        /* Unknown mode: do nothing */
    }
#endif /* (!UART1_CY_SCBIP_V1) */

#elif (UART1_SCB_MODE_SPI_CONST_CFG)
    UART1_SpiPostEnable();

#elif (UART1_SCB_MODE_UART_CONST_CFG)
    UART1_UartPostEnable();

#else
    /* Unknown mode: do nothing */
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */
}


/*******************************************************************************
* Function Name: UART1_ScbModeStop
****************************************************************************//**
*
*  Calls the Stop function for a specific operation mode.
*
*******************************************************************************/
static void UART1_ScbModeStop(void)
{
#if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    if (UART1_SCB_MODE_I2C_RUNTM_CFG)
    {
        UART1_I2CStop();
    }
    else if (UART1_SCB_MODE_EZI2C_RUNTM_CFG)
    {
        UART1_EzI2CStop();
    }
#if (!UART1_CY_SCBIP_V1)
    else if (UART1_SCB_MODE_SPI_RUNTM_CFG)
    {
        UART1_SpiStop();
    }
    else if (UART1_SCB_MODE_UART_RUNTM_CFG)
    {
        UART1_UartStop();
    }
#endif /* (!UART1_CY_SCBIP_V1) */
    else
    {
        /* Unknown mode: do nothing */
    }
#elif (UART1_SCB_MODE_I2C_CONST_CFG)
    UART1_I2CStop();

#elif (UART1_SCB_MODE_EZI2C_CONST_CFG)
    UART1_EzI2CStop();

#elif (UART1_SCB_MODE_SPI_CONST_CFG)
    UART1_SpiStop();

#elif (UART1_SCB_MODE_UART_CONST_CFG)
    UART1_UartStop();

#else
    /* Unknown mode: do nothing */
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */
}


#if (UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    /*******************************************************************************
    * Function Name: UART1_SetPins
    ****************************************************************************//**
    *
    *  Sets the pins settings accordingly to the selected operation mode.
    *  Only available in the Unconfigured operation mode. The mode specific
    *  initialization function calls it.
    *  Pins configuration is set by PSoC Creator when a specific mode of operation
    *  is selected in design time.
    *
    *  \param mode:      Mode of SCB operation.
    *  \param subMode:   Sub-mode of SCB operation. It is only required for SPI and UART
    *             modes.
    *  \param uartEnableMask: enables TX or RX direction and RTS and CTS signals.
    *
    *******************************************************************************/
    void UART1_SetPins(uint32 mode, uint32 subMode, uint32 uartEnableMask)
    {
        uint32 pinsDm[UART1_SCB_PINS_NUMBER];
        uint32 i;
        
    #if (!UART1_CY_SCBIP_V1)
        uint32 pinsInBuf = 0u;
    #endif /* (!UART1_CY_SCBIP_V1) */
        
        uint32 hsiomSel[UART1_SCB_PINS_NUMBER] = 
        {
            UART1_RX_SCL_MOSI_HSIOM_SEL_GPIO,
            UART1_TX_SDA_MISO_HSIOM_SEL_GPIO,
            0u,
            0u,
            0u,
            0u,
            0u,
        };

    #if (UART1_CY_SCBIP_V1)
        /* Supress compiler warning. */
        if ((0u == subMode) || (0u == uartEnableMask))
        {
        }
    #endif /* (UART1_CY_SCBIP_V1) */

        /* Set default HSIOM to GPIO and Drive Mode to Analog Hi-Z */
        for (i = 0u; i < UART1_SCB_PINS_NUMBER; i++)
        {
            pinsDm[i] = UART1_PIN_DM_ALG_HIZ;
        }

        if ((UART1_SCB_MODE_I2C   == mode) ||
            (UART1_SCB_MODE_EZI2C == mode))
        {
        #if (UART1_RX_SCL_MOSI_PIN)
            hsiomSel[UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_RX_SCL_MOSI_HSIOM_SEL_I2C;
            pinsDm  [UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_PIN_DM_OD_LO;
        #elif (UART1_RX_WAKE_SCL_MOSI_PIN)
            hsiomSel[UART1_RX_WAKE_SCL_MOSI_PIN_INDEX] = UART1_RX_WAKE_SCL_MOSI_HSIOM_SEL_I2C;
            pinsDm  [UART1_RX_WAKE_SCL_MOSI_PIN_INDEX] = UART1_PIN_DM_OD_LO;
        #else
        #endif /* (UART1_RX_SCL_MOSI_PIN) */
        
        #if (UART1_TX_SDA_MISO_PIN)
            hsiomSel[UART1_TX_SDA_MISO_PIN_INDEX] = UART1_TX_SDA_MISO_HSIOM_SEL_I2C;
            pinsDm  [UART1_TX_SDA_MISO_PIN_INDEX] = UART1_PIN_DM_OD_LO;
        #endif /* (UART1_TX_SDA_MISO_PIN) */
        }
    #if (!UART1_CY_SCBIP_V1)
        else if (UART1_SCB_MODE_SPI == mode)
        {
        #if (UART1_RX_SCL_MOSI_PIN)
            hsiomSel[UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_RX_SCL_MOSI_HSIOM_SEL_SPI;
        #elif (UART1_RX_WAKE_SCL_MOSI_PIN)
            hsiomSel[UART1_RX_WAKE_SCL_MOSI_PIN_INDEX] = UART1_RX_WAKE_SCL_MOSI_HSIOM_SEL_SPI;
        #else
        #endif /* (UART1_RX_SCL_MOSI_PIN) */
        
        #if (UART1_TX_SDA_MISO_PIN)
            hsiomSel[UART1_TX_SDA_MISO_PIN_INDEX] = UART1_TX_SDA_MISO_HSIOM_SEL_SPI;
        #endif /* (UART1_TX_SDA_MISO_PIN) */
        
        #if (UART1_SCLK_PIN)
            hsiomSel[UART1_SCLK_PIN_INDEX] = UART1_SCLK_HSIOM_SEL_SPI;
        #endif /* (UART1_SCLK_PIN) */

            if (UART1_SPI_SLAVE == subMode)
            {
                /* Slave */
                pinsDm[UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;
                pinsDm[UART1_TX_SDA_MISO_PIN_INDEX] = UART1_PIN_DM_STRONG;
                pinsDm[UART1_SCLK_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;

            #if (UART1_SS0_PIN)
                /* Only SS0 is valid choice for Slave */
                hsiomSel[UART1_SS0_PIN_INDEX] = UART1_SS0_HSIOM_SEL_SPI;
                pinsDm  [UART1_SS0_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;
            #endif /* (UART1_SS0_PIN) */

            #if (UART1_TX_SDA_MISO_PIN)
                /* Disable input buffer */
                 pinsInBuf |= UART1_TX_SDA_MISO_PIN_MASK;
            #endif /* (UART1_TX_SDA_MISO_PIN) */
            }
            else 
            {
                /* (Master) */
                pinsDm[UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_PIN_DM_STRONG;
                pinsDm[UART1_TX_SDA_MISO_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;
                pinsDm[UART1_SCLK_PIN_INDEX] = UART1_PIN_DM_STRONG;

            #if (UART1_SS0_PIN)
                hsiomSel [UART1_SS0_PIN_INDEX] = UART1_SS0_HSIOM_SEL_SPI;
                pinsDm   [UART1_SS0_PIN_INDEX] = UART1_PIN_DM_STRONG;
                pinsInBuf |= UART1_SS0_PIN_MASK;
            #endif /* (UART1_SS0_PIN) */

