gitmac56/Git_IR_REMO/PSoC/C4245AZI-483.cydsn/codegentemp/UART1.c
            #if (UART1_SS1_PIN)
                hsiomSel [UART1_SS1_PIN_INDEX] = UART1_SS1_HSIOM_SEL_SPI;
                pinsDm   [UART1_SS1_PIN_INDEX] = UART1_PIN_DM_STRONG;
                pinsInBuf |= UART1_SS1_PIN_MASK;
            #endif /* (UART1_SS1_PIN) */

            #if (UART1_SS2_PIN)
                hsiomSel [UART1_SS2_PIN_INDEX] = UART1_SS2_HSIOM_SEL_SPI;
                pinsDm   [UART1_SS2_PIN_INDEX] = UART1_PIN_DM_STRONG;
                pinsInBuf |= UART1_SS2_PIN_MASK;
            #endif /* (UART1_SS2_PIN) */

            #if (UART1_SS3_PIN)
                hsiomSel [UART1_SS3_PIN_INDEX] = UART1_SS3_HSIOM_SEL_SPI;
                pinsDm   [UART1_SS3_PIN_INDEX] = UART1_PIN_DM_STRONG;
                pinsInBuf |= UART1_SS3_PIN_MASK;
            #endif /* (UART1_SS3_PIN) */

                /* Disable input buffers */
            #if (UART1_RX_SCL_MOSI_PIN)
                pinsInBuf |= UART1_RX_SCL_MOSI_PIN_MASK;
            #elif (UART1_RX_WAKE_SCL_MOSI_PIN)
                pinsInBuf |= UART1_RX_WAKE_SCL_MOSI_PIN_MASK;
            #else
            #endif /* (UART1_RX_SCL_MOSI_PIN) */

            #if (UART1_SCLK_PIN)
                pinsInBuf |= UART1_SCLK_PIN_MASK;
            #endif /* (UART1_SCLK_PIN) */
            }
        }
        else /* UART */
        {
            if (UART1_UART_MODE_SMARTCARD == subMode)
            {
                /* SmartCard */
            #if (UART1_TX_SDA_MISO_PIN)
                hsiomSel[UART1_TX_SDA_MISO_PIN_INDEX] = UART1_TX_SDA_MISO_HSIOM_SEL_UART;
                pinsDm  [UART1_TX_SDA_MISO_PIN_INDEX] = UART1_PIN_DM_OD_LO;
            #endif /* (UART1_TX_SDA_MISO_PIN) */
            }
            else /* Standard or IrDA */
            {
                if (0u != (UART1_UART_RX_PIN_ENABLE & uartEnableMask))
                {
                #if (UART1_RX_SCL_MOSI_PIN)
                    hsiomSel[UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_RX_SCL_MOSI_HSIOM_SEL_UART;
                    pinsDm  [UART1_RX_SCL_MOSI_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;
                #elif (UART1_RX_WAKE_SCL_MOSI_PIN)
                    hsiomSel[UART1_RX_WAKE_SCL_MOSI_PIN_INDEX] = UART1_RX_WAKE_SCL_MOSI_HSIOM_SEL_UART;
                    pinsDm  [UART1_RX_WAKE_SCL_MOSI_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;
                #else
                #endif /* (UART1_RX_SCL_MOSI_PIN) */
                }

                if (0u != (UART1_UART_TX_PIN_ENABLE & uartEnableMask))
                {
                #if (UART1_TX_SDA_MISO_PIN)
                    hsiomSel[UART1_TX_SDA_MISO_PIN_INDEX] = UART1_TX_SDA_MISO_HSIOM_SEL_UART;
                    pinsDm  [UART1_TX_SDA_MISO_PIN_INDEX] = UART1_PIN_DM_STRONG;
                    
                    /* Disable input buffer */
                    pinsInBuf |= UART1_TX_SDA_MISO_PIN_MASK;
                #endif /* (UART1_TX_SDA_MISO_PIN) */
                }

            #if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
                if (UART1_UART_MODE_STD == subMode)
                {
                    if (0u != (UART1_UART_CTS_PIN_ENABLE & uartEnableMask))
                    {
                        /* CTS input is multiplexed with SCLK */
                    #if (UART1_SCLK_PIN)
                        hsiomSel[UART1_SCLK_PIN_INDEX] = UART1_SCLK_HSIOM_SEL_UART;
                        pinsDm  [UART1_SCLK_PIN_INDEX] = UART1_PIN_DM_DIG_HIZ;
                    #endif /* (UART1_SCLK_PIN) */
                    }

                    if (0u != (UART1_UART_RTS_PIN_ENABLE & uartEnableMask))
                    {
                        /* RTS output is multiplexed with SS0 */
                    #if (UART1_SS0_PIN)
                        hsiomSel[UART1_SS0_PIN_INDEX] = UART1_SS0_HSIOM_SEL_UART;
                        pinsDm  [UART1_SS0_PIN_INDEX] = UART1_PIN_DM_STRONG;
                        
                        /* Disable input buffer */
                        pinsInBuf |= UART1_SS0_PIN_MASK;
                    #endif /* (UART1_SS0_PIN) */
                    }
                }
            #endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
            }
        }
    #endif /* (!UART1_CY_SCBIP_V1) */

    /* Configure pins: set HSIOM, DM and InputBufEnable */
    /* Note: the DR register settings do not effect the pin output if HSIOM is other than GPIO */

    #if (UART1_RX_SCL_MOSI_PIN)
        UART1_SET_HSIOM_SEL(UART1_RX_SCL_MOSI_HSIOM_REG,
                                       UART1_RX_SCL_MOSI_HSIOM_MASK,
                                       UART1_RX_SCL_MOSI_HSIOM_POS,
                                        hsiomSel[UART1_RX_SCL_MOSI_PIN_INDEX]);

        UART1_uart_rx_i2c_scl_spi_mosi_SetDriveMode((uint8) pinsDm[UART1_RX_SCL_MOSI_PIN_INDEX]);

        #if (!UART1_CY_SCBIP_V1)
            UART1_SET_INP_DIS(UART1_uart_rx_i2c_scl_spi_mosi_INP_DIS,
                                         UART1_uart_rx_i2c_scl_spi_mosi_MASK,
                                         (0u != (pinsInBuf & UART1_RX_SCL_MOSI_PIN_MASK)));
        #endif /* (!UART1_CY_SCBIP_V1) */
    
    #elif (UART1_RX_WAKE_SCL_MOSI_PIN)
        UART1_SET_HSIOM_SEL(UART1_RX_WAKE_SCL_MOSI_HSIOM_REG,
                                       UART1_RX_WAKE_SCL_MOSI_HSIOM_MASK,
                                       UART1_RX_WAKE_SCL_MOSI_HSIOM_POS,
                                       hsiomSel[UART1_RX_WAKE_SCL_MOSI_PIN_INDEX]);

        UART1_uart_rx_wake_i2c_scl_spi_mosi_SetDriveMode((uint8)
                                                               pinsDm[UART1_RX_WAKE_SCL_MOSI_PIN_INDEX]);

        UART1_SET_INP_DIS(UART1_uart_rx_wake_i2c_scl_spi_mosi_INP_DIS,
                                     UART1_uart_rx_wake_i2c_scl_spi_mosi_MASK,
                                     (0u != (pinsInBuf & UART1_RX_WAKE_SCL_MOSI_PIN_MASK)));

         /* Set interrupt on falling edge */
        UART1_SET_INCFG_TYPE(UART1_RX_WAKE_SCL_MOSI_INTCFG_REG,
                                        UART1_RX_WAKE_SCL_MOSI_INTCFG_TYPE_MASK,
                                        UART1_RX_WAKE_SCL_MOSI_INTCFG_TYPE_POS,
                                        UART1_INTCFG_TYPE_FALLING_EDGE);
    #else
    #endif /* (UART1_RX_WAKE_SCL_MOSI_PIN) */

    #if (UART1_TX_SDA_MISO_PIN)
        UART1_SET_HSIOM_SEL(UART1_TX_SDA_MISO_HSIOM_REG,
                                       UART1_TX_SDA_MISO_HSIOM_MASK,
                                       UART1_TX_SDA_MISO_HSIOM_POS,
                                        hsiomSel[UART1_TX_SDA_MISO_PIN_INDEX]);

        UART1_uart_tx_i2c_sda_spi_miso_SetDriveMode((uint8) pinsDm[UART1_TX_SDA_MISO_PIN_INDEX]);

    #if (!UART1_CY_SCBIP_V1)
        UART1_SET_INP_DIS(UART1_uart_tx_i2c_sda_spi_miso_INP_DIS,
                                     UART1_uart_tx_i2c_sda_spi_miso_MASK,
                                    (0u != (pinsInBuf & UART1_TX_SDA_MISO_PIN_MASK)));
    #endif /* (!UART1_CY_SCBIP_V1) */
    #endif /* (UART1_RX_SCL_MOSI_PIN) */

    #if (UART1_SCLK_PIN)
        UART1_SET_HSIOM_SEL(UART1_SCLK_HSIOM_REG,
                                       UART1_SCLK_HSIOM_MASK,
                                       UART1_SCLK_HSIOM_POS,
                                       hsiomSel[UART1_SCLK_PIN_INDEX]);

        UART1_spi_sclk_SetDriveMode((uint8) pinsDm[UART1_SCLK_PIN_INDEX]);

