gitmac56/Git_IR_REMO/PSoC/C4245AZI-483.cydsn/codegentemp/UART1.c
        UART1_SET_INP_DIS(UART1_spi_sclk_INP_DIS,
                                     UART1_spi_sclk_MASK,
                                     (0u != (pinsInBuf & UART1_SCLK_PIN_MASK)));
    #endif /* (UART1_SCLK_PIN) */

    #if (UART1_SS0_PIN)
        UART1_SET_HSIOM_SEL(UART1_SS0_HSIOM_REG,
                                       UART1_SS0_HSIOM_MASK,
                                       UART1_SS0_HSIOM_POS,
                                       hsiomSel[UART1_SS0_PIN_INDEX]);

        UART1_spi_ss0_SetDriveMode((uint8) pinsDm[UART1_SS0_PIN_INDEX]);

        UART1_SET_INP_DIS(UART1_spi_ss0_INP_DIS,
                                     UART1_spi_ss0_MASK,
                                     (0u != (pinsInBuf & UART1_SS0_PIN_MASK)));
    #endif /* (UART1_SS0_PIN) */

    #if (UART1_SS1_PIN)
        UART1_SET_HSIOM_SEL(UART1_SS1_HSIOM_REG,
                                       UART1_SS1_HSIOM_MASK,
                                       UART1_SS1_HSIOM_POS,
                                       hsiomSel[UART1_SS1_PIN_INDEX]);

        UART1_spi_ss1_SetDriveMode((uint8) pinsDm[UART1_SS1_PIN_INDEX]);

        UART1_SET_INP_DIS(UART1_spi_ss1_INP_DIS,
                                     UART1_spi_ss1_MASK,
                                     (0u != (pinsInBuf & UART1_SS1_PIN_MASK)));
    #endif /* (UART1_SS1_PIN) */

    #if (UART1_SS2_PIN)
        UART1_SET_HSIOM_SEL(UART1_SS2_HSIOM_REG,
                                       UART1_SS2_HSIOM_MASK,
                                       UART1_SS2_HSIOM_POS,
                                       hsiomSel[UART1_SS2_PIN_INDEX]);

        UART1_spi_ss2_SetDriveMode((uint8) pinsDm[UART1_SS2_PIN_INDEX]);

        UART1_SET_INP_DIS(UART1_spi_ss2_INP_DIS,
                                     UART1_spi_ss2_MASK,
                                     (0u != (pinsInBuf & UART1_SS2_PIN_MASK)));
    #endif /* (UART1_SS2_PIN) */

    #if (UART1_SS3_PIN)
        UART1_SET_HSIOM_SEL(UART1_SS3_HSIOM_REG,
                                       UART1_SS3_HSIOM_MASK,
                                       UART1_SS3_HSIOM_POS,
                                       hsiomSel[UART1_SS3_PIN_INDEX]);

        UART1_spi_ss3_SetDriveMode((uint8) pinsDm[UART1_SS3_PIN_INDEX]);

        UART1_SET_INP_DIS(UART1_spi_ss3_INP_DIS,
                                     UART1_spi_ss3_MASK,
                                     (0u != (pinsInBuf & UART1_SS3_PIN_MASK)));
    #endif /* (UART1_SS3_PIN) */
    }

#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */


#if (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    /*******************************************************************************
    * Function Name: UART1_I2CSlaveNackGeneration
    ****************************************************************************//**
    *
    *  Sets command to generate NACK to the address or data.
    *
    *******************************************************************************/
    void UART1_I2CSlaveNackGeneration(void)
    {
        /* Check for EC_AM toggle condition: EC_AM and clock stretching for address are enabled */
        if ((0u != (UART1_CTRL_REG & UART1_CTRL_EC_AM_MODE)) &&
            (0u == (UART1_I2C_CTRL_REG & UART1_I2C_CTRL_S_NOT_READY_ADDR_NACK)))
        {
            /* Toggle EC_AM before NACK generation */
            UART1_CTRL_REG &= ~UART1_CTRL_EC_AM_MODE;
            UART1_CTRL_REG |=  UART1_CTRL_EC_AM_MODE;
        }

        UART1_I2C_SLAVE_CMD_REG = UART1_I2C_SLAVE_CMD_S_NACK;
    }
#endif /* (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */


/* [] END OF FILE */
